[{"id":68,"short_name":"ancient_apparition","display_name":"Ancient Apparition","description":"Able to launch a powerful blast of \u003cb\u003edamaging ice\u003c/b\u003e across the battlefield, Ancient Apparition threatens to shatter weakened enemies wherever they are. Slowing enemies as he enhances his allies' effectiveness in battle, he is a constant threat to his foes.","lore":"Kaldr, the Ancient Apparition, is an image projected from outside time. He springs from the cold, infinite void that both predates the universe and awaits its end. Kaldr is, Kaldr was, Kaldr shall be...and what we perceive, powerful as it appears to us, is but the faintest faded echo of the true, eternal Kaldr. Some believe that as the cosmos ages and approaches its final moments, the brightness and power of Kaldr will also intensify--that the Ancient Apparition will grow younger and stronger as eternity's end draws nigh. His grip of ice will bring all matter to a stop, his image will cast a light too terrible to behold. An Apparition no longer!","attack_type":"Ranged","primary_attribute":"int","abilities":[{"id":5345,"short_name":"ancient_apparition_cold_feet","display_name":"Cold Feet","button":"Q","description":"Places Death Rime Stacks on an enemy that can be dispelled by moving away from the initial cast point.  If the enemy unit doesn't move outside of the given range, it will be stunned and frozen in place after 4 seconds.","attributes":"DEATH RIME STACKS: 2 / 4 / 6 / 8\nSTUN DURATION: 1.9 / 2.2 / 2.5 / 2.8\nBREAK DISTANCE: 725 / 750 / 775 / 800"},{"id":5346,"short_name":"ancient_apparition_ice_vortex","display_name":"Ice Vortex","button":"W","description":"Creates a vortex of icy energy that applies Death Rime Stacks and increases magic damage done to enemies in its range.","attributes":"INCREASED MAGIC DAMAGE: -16% / -19% / -22% / -25%\nRADIUS: 300\nDEATH RIME STACKS: 1 / 2 / 3 / 4\nDURATION: 6 / 8 / 10 / 12"},{"id":5347,"short_name":"ancient_apparition_chilling_touch","display_name":"Chilling Touch","button":"E","description":"Enhances Ancient Apparition's attack with increased range and heavy magic damage. Applies a Death Rime Stack that lasts for 4 seconds. Additionally applies a 100% slow for 0.7 / 0.8 / 0.9 / 1 seconds.","attributes":"DAMAGE: 30 / 60 / 90 / 120\nDEATH RIME STACKS: 1\nATTACK RANGE BONUS: 60 / 120 / 180 / 240"},{"id":1326,"short_name":"ancient_apparition_death_rime","display_name":"Death Rime","button":"F","description":"Ancient Apparition's abilities apply Death Rime Stacks on enemies. Death Rime slows enemies' movement speed and deals damage over time.","attributes":"DAMAGE PER SECOND PER STACK: 10\nDAMAGE INCREASE PER 2.5 MINUTES:%damage_per_minute%\nMOVEMENT SLOW PER STACK: 2%\nCAST SPEED SLOW PER STACK: 0%\nSTR REDUCTION PER STACK: 0"},{"id":5348,"short_name":"ancient_apparition_ice_blast","display_name":"Ice Blast","button":"R","description":"Launches a tracer toward any location on the battlefield, which must be triggered again to mark the area to be blasted by a damaging explosion of hail. The further the tracer travels, the larger the explosion will be. Enemies caught in the explosion, or who touch the icy ball of hail as it travels, are Frostbitten, gaining Death Rime Stacks and prevented from regenerating or healing. If a Frostbitten unit's health drops below a certain percentage, they will instantly shatter.","attributes":"COLD FEET AOE: \nFROSTBITTEN DURATION: 10 / 11 / 12\nDEATH RIME STACKS: 2\nSHATTER HEALTH THRESHOLD: 12% / 13% / 14%\nPATH RADIUS: 275\nSCEPTER FROSTBITTEN DURATION:%frostbite_duration_scepter%"},{"id":5349,"short_name":"ancient_apparition_ice_blast_release","display_name":"Release","button":"Passive","description":"Releases the ice blast to explode at the tracer's current location.","attributes":""}]},{"id":14,"short_name":"pudge","display_name":"Pudge","description":"Each carefully aimed throw of Pudge's \u003cb\u003esignature hook\u003c/b\u003e strikes fear into his foes. \u003cb\u003ePulling\u003c/b\u003e his enemies near to carve them with his cleavers, he gains \u003cb\u003eadditional health and damage\u003c/b\u003e with every kill, and soon becomes an unstoppable killer.","lore":"In the Fields of Endless Carnage, far to the south of Quoidge, a corpulent figure works tirelessly through the night--dismembering, disembowelling, piling up the limbs and viscera of the fallen that the battlefield might be clear by dawn. In this cursed realm, nothing can decay or decompose; no corpse may ever return to the earth from which it sprang, no matter how deep you dig the grave. Flocked by carrion birds who need him to cut their meals into beak-sized chunks, Pudge the Butcher hones his skills with blades that grow sharper the longer he uses them. Swish, swish, thunk. Flesh falls from the bone; tendons and ligaments part like wet paper. And while he always had a taste for the butchery, over the ages, Pudge has developed a taste for its byproduct as well. Starting with a gobbet of muscle here, a sip of blood there...before long he was thrusting his jaws deep into the toughest of torsos, like a dog gnawing at rags. Even those who are beyond fearing the Reaper, fear the Butcher.","attack_type":"Melee","primary_attribute":"str","abilities":[{"id":5075,"short_name":"pudge_meat_hook","display_name":"Meat Hook","button":"Q","description":"Launches a bloody hook toward a unit or location. The hook will snag the first unit it encounters, dragging the unit back to Pudge, killing it if it's a non-ancient creep and dealing damage if it is an enemy otherwise.","attributes":"DAMAGE: 150 / 220 / 290 / 360\nCAST RANGE: 1300\nDISTANCE AS DAMAGE: %"},{"id":5076,"short_name":"pudge_rot","display_name":"Rot","button":"W","description":"A toxic cloud that deals intense damage and slows movement--harming not only enemy units but Pudge himself.","attributes":"RADIUS: 250\nMOVE SLOW: -14% / -20% / -26% / -32%\nDAMAGE: 30 / 60 / 90 / 120\nREGEN REDUCTION: 20%"},{"id":5074,"short_name":"pudge_flesh_heap","display_name":"Meat Shield","button":"E","description":"Pudge covers himself with a layer of flesh that blocks damage of any type taken from any source.","attributes":"DAMAGE BLOCK: 8 / 14 / 20 / 26\nDURATION: 4 / 5 / 6 / 7"},{"id":322,"short_name":"pudge_eject","display_name":"Eject","button":"Passive","description":"Ejects the swallowed allied hero inside of you.","attributes":""},{"id":1223,"short_name":"pudge_innate_graft_flesh","display_name":"Flesh Heap","button":"Passive","description":"Each time Pudge kills an enemy Hero, he permanently gains 1.1 / 1.4 / 1.7 / 2.0 bonus Strength.","attributes":""},{"id":5077,"short_name":"pudge_dismember","display_name":"Dismember","button":"R","description":"CHANNELED - Pudge chows down on an enemy unit, disabling it and dealing damage over time. Damage is increased by Pudge's Strength and heals him for the total amount. Pudge pulls the unit at a rate of 75 units, up to a minimum of 125 range.","attributes":"DAMAGE PER SECOND: 80 / 100 / 120\nSTRENGTH MULTIPLIER: 0.3 / 0.6 / 0.9\nMAX HP REGEN: 5%\nALLY CAST RANGE: 300\nCOOLDOWN: 30 / 25 / 20\nSTRENGTH INCREASE: 0\nSTRENGTH DURATION: 0"}]},{"id":50,"short_name":"dazzle","display_name":"Dazzle","description":"Born to support his cohorts in battle, Dazzle \u003cb\u003ekeeps wounded allies alive\u003c/b\u003e so they might later rain death upon the enemy. His \u003cb\u003estrange magic\u003c/b\u003e weaves its way into \u003cb\u003enearby armor\u003c/b\u003e, weakening enemies and strengthening friends.","lore":"Each young acolyte to the Dezun order must complete a series of rites before becoming a shadow priest. The final rite, the rite of shades, is a harrowing spiritual journey through the Nothl Realm, an unpredictable domain from which not all visitants return.  Of those who do, some return mad. Others return with strange aptitudes. But all who go there are changed by their experiences.\r\n\t\t\t\t\u003cbr\u003e\u003cbr\u003eDriven by the need for enlightenment, Dazzle was the youngest of his tribe ever to request the sacred ritual. At first the order refused him, saying he was too young. But Dazzle was not to be dissuaded. Sensing something special in the headstrong young acolyte, the elders relented. Dazzle drank down the sacred potion and sat by the fire while the rest of his tribe danced through the night.\r\n\t\t\t\t\u003cbr\u003e\u003cbr\u003eIn this ethereal dimension of the Nothl Realm, the properties of light and dark are inverted. Thus his brilliant healing light, beautiful to our eye, is actually a sinister kind of evil; and the darkest deeds are done in a dazzling glow. The elders' intuition was prophetic: Dazzle returned to his people as a Shadow Priest like none seen before, with the power to heal as well as to destroy. Now he uses his gift to cut down his enemies and mend his friends.","attack_type":"Ranged","primary_attribute":"all","abilities":[{"id":5233,"short_name":"dazzle_poison_touch","display_name":"Poison Touch","button":"Q","description":"Releases a cone of poison that strikes multiple enemy units. Deals damage over time and slows the targets. Anytime the targets get attacked by Dazzle, the debuff duration is refreshed and slow is increased.","attributes":"TARGETS: 2 / 4 / 6 / 8\nDAMAGE PER SECOND: 16 / 28 / 40 / 52\nSLOW: -16% / -18% / -20% / -22%\nBONUS SLOW PER HIT: -2% / -2.5% / -3% / -3.5%\nDURATION: 5 / 6 / 7 / 8\nSPLIT DAMAGE: 0"},{"id":5234,"short_name":"dazzle_shallow_grave","display_name":"Shallow Grave","button":"W","description":"An ally blessed with Shallow Grave, no matter how close to death, cannot die while under its protection. Healing on that ally is also amplified for the duration based on the hero's HP.","attributes":"DURATION: 3.5 / 4 / 4.5 / 5.0\nHEAL AMPLIFICATION PER 10% MISSING: 2% / 4% / 6% / 8%"},{"id":5235,"short_name":"dazzle_shadow_wave","display_name":"Shadow Wave","button":"E","description":"Sends out a bolt of power that arcs between allies, healing them while damaging any enemy units standing nearby.  Dazzle is always healed by Shadow Wave.","attributes":"HEAL ARC RADIUS: 475\nMAX HEAL TARGETS: 4 / 5 / 6 / 7\nDAMAGE RADIUS: 185\nDAMAGE: 85 / 105 / 125 / 145"},{"id":1293,"short_name":"dazzle_innate_weave","display_name":"Weave","button":"Passive","description":"Dazzle's abilities apply Weave to both allies and enemies they affect, increasing allied armor and reducing enemy armor. Multiple instances of this effect stack.","attributes":"DURATION: 10\nARMOR CHANGE PER STACK: 1"},{"id":7304,"short_name":"dazzle_bad_juju","display_name":"Bad Juju","button":"R","description":"Decreases the remaining cooldown of all other abilities. Casting Bad Juju temporarily increases its health cost.","attributes":"COOLDOWN REDUCTION ABILITIES: 4 / 5 / 6\nHEALTH COST INCREASE PER CAST: 40%\nHEALTH COST INCREASE DURATION: 20"}]}]
