[{"id":2,"short_name":"axe","display_name":"Axe","description":"One after another, Axe cuts down his foes. Marching ahead of his team, he \u003cb\u003elocks his enemies in battle\u003c/b\u003e then counters their blows with a \u003cb\u003edeadly spin\u003c/b\u003e of his weapon. Slamming his \u003cb\u003eculling blade\u003c/b\u003e through a weakened enemy, he is always charging onward.","lore":"As a grunt in the Army of Red Mist, Mogul Khan set his sights on the rank of Red Mist General. In battle after battle he proved his worth through gory deed. His rise through the ranks was helped by the fact that he never hesitated to decapitate a superior. Through the seven year Campaign of the Thousand Tarns, he distinguished himself in glorious carnage, his star of fame shining ever brighter, while the number of comrades in arms steadily dwindled. On the night of ultimate victory, Axe declared himself the new Red Mist General, and took on the ultimate title of 'Axe.' But his troops now numbered zero. Of course, many had died in battle, but a significant number had also fallen to Axe's blade. Needless to say, most soldiers now shun his leadership. But this matters not a whit to Axe, who knows that a one-man army is by far the best.","attack_type":"Melee","primary_attribute":"str","abilities":[{"id":5007,"short_name":"axe_berserkers_call","display_name":"Berserker's Call","button":"Q","description":"Axe taunts nearby enemy units, forcing them to attack him while he gains bonus armor during the duration.","attributes":["RADIUS: 315","BONUS ARMOR: 12 / 13 / 14 / 15","DURATION: 1.8 / 2.2 / 2.6 / 3.0","ENEMY ATTACK SPEED BONUS: 0"]},{"id":5008,"short_name":"axe_battle_hunger","display_name":"Battle Hunger","button":"W","description":"Enrages an enemy unit, causing it to take damage over time until it kills another unit or the duration ends. The damage is increased by a factor of Axe's armor. The enemy is also slowed as long as they are facing away from Axe.","attributes":["DURATION: 12.0","MOVEMENT SLOW: -15% / -20% / -25% / -30%","DAMAGE PER SECOND: 10 / 15 / 20 / 25","ARMOR MULTIPLIER: 1"]},{"id":5009,"short_name":"axe_counter_helix","display_name":"Counter Helix","button":"Passive","description":"After a set number of attacks, Axe will perform a helix counter attack, dealing pure damage to all nearby enemies.","attributes":["DEBUFF DURATION:%shard_debuff_duration%","%ATTACK REDUCTION:%shard_damage_reduction%","MAX STACKS:%shard_max_stacks%","DAMAGE: 95 / 120 / 145 / 170","RADIUS: 275","ATTACKS TO HELIX: 7 / 6 / 5 / 4"]},{"id":5010,"short_name":"axe_culling_blade","display_name":"Culling Blade","button":"R","description":"Axe spots a weakness and strikes, dealing pure damage. When an enemy hero is killed with Culling Blade, its cooldown is reset, and all nearby allied units gain bonus movement speed and armor.","attributes":["DAMAGE: 275 / 375 / 475","KILL MOVE SPEED BONUS: 20% / 25% / 30%","KILL ARMOR BONUS: 20 / 25 / 30","KILL BUFF RADIUS: 900","KILL BUFF DURATION: 6","ARMOR PER KILL: 0"]},{"id":1201,"short_name":"axe_coat_of_blood","display_name":"Coat of Blood","button":"T","description":"Whenever Axe gets a kill, he permanently gains 0.2 / 0.3 / 0.4 / .5 armor. Killing with Culling Blade gives 3x that amount.","attributes":[]}]},{"id":62,"short_name":"bounty_hunter","display_name":"Bounty Hunter","description":"Sneaking \u003cb\u003einvisibly\u003c/b\u003e at the heels of his enemies, Bounty Hunter is always keeping track of his foes. Whenever one of his targets falls in battle, he and his allies stand to \u003cb\u003emake quite a profit\u003c/b\u003e.","lore":"When the hunted tell tales of Gondar the Bounty Hunter, none are sure of which are true. In whispered tones they say he was abandoned as a kit, learning his skill in tracking as a matter of simple survival. Others hear he was an orphan of war, taken in by the great Soruq the Hunter to learn the master's skill with a blade as they plumbed the dark forests for big game. Still others believe he was a lowly street urchin raised among a guild of cutpurses and thieves, trained in the arts of stealth and misdirection. Around campfires in the wild countryside his quarry speaks the rumors of Gondar's work, growing ever more fearful: they say it was he who tracked down the tyrant King Goff years after the mad regent went into hiding, delivering his head and scepter as proof. That it was he who infiltrated the rebel camps at Highseat, finally bringing the legendary thief White Cape to be judged for his crimes. And that it was he who ended the career of Soruq the Hunter, condemned as a criminal for killing the Prince's prized hellkite. The tales of Gondar's incredible skill stretch on, with each daring feat more unbelievable than the last, each target more elusive. For the right price, the hunted know, anyone can be found. For the right price, even the mightiest may find fear in the shadows.","attack_type":"Melee","primary_attribute":"agi","abilities":[{"id":1314,"short_name":"bounty_hunter_shuriken_toss","display_name":"Shuriken Toss","button":"Q","description":"Hurls a deadly shuriken at an enemy unit, dealing damage and slowing the target's Movement Speed by 100% for 0.35s. The shuriken will bounce to any Tracked units who are within a 1200 radius of each other.","attributes":["DAMAGE: 100 / 170 / 240 / 310","CAST RANGE: 375 / 425 / 475 / 525","CAST RANGE: 600"]},{"id":5286,"short_name":"bounty_hunter_jinada","display_name":"Jinada","button":"W","description":"Bounty Hunter plans his next hit, dealing bonus damage and stealing some unreliable gold.","attributes":["BONUS DAMAGE: 70 / 105 / 140 / 175","GOLD STEAL: 12 / 20 / 28 / 36"]},{"id":5287,"short_name":"bounty_hunter_wind_walk","display_name":"Shadow Walk","button":"E","description":"Bounty Hunter becomes invisible and gains the ability to move through other units until he attacks or uses an ability.  If he breaks the invisibility with an attack, that attack will stun the target for a short duration.","attributes":["INVISIBILITY DURATION: 20.0 / 25.0 / 30.0 / 35.0","FADE TIME: 1.0 / 0.75 / 0.5 / 0.25","SLOW DURATION:%slow_duration%","STUN DURATION:%shard_stun_duration%","%DAMAGE REDUCTION:%shard_damage_reduction_pct%","STUN DURATION: 0.8 / 1.0 / 1.2 / 1.4"]},{"id":1136,"short_name":"bounty_hunter_wind_walk_ally","display_name":"Friendly Shadow","button":"F","description":"Applies Shadow Walk and all of its bonuses to the target ally. Allied fade time is 1.0s. Does not break Bounty Hunter's invisibility when cast.","attributes":[]},{"id":1316,"short_name":"bounty_hunter_big_game_hunter","display_name":"Big Game Hunter","button":"Passive","description":"When getting a kill or assist on an enemy that has a killing streak, Bounty Hunter receives 20% extra gold.","attributes":[]},{"id":5288,"short_name":"bounty_hunter_track","display_name":"Track","button":"R","description":"Tracks an enemy hero, granting True Sight of the target, increasing the damage they take and providing information on how much gold it is carrying. Bounty Hunter moves fast when near the tracked unit. If the target dies, Bounty Hunter and nearby heroes collect a bonus bounty of gold. Casting Track does not take you out of invisibility.","attributes":["DAMAGE AMPLIFICATION: 6% / 12% / 18%","SELF BONUS SPEED: 16% / 20% / 24%","ALLIES BONUS GOLD: 40 / 80 / 120","SELF BONUS GOLD: 130 / 225 / 320","DURATION: 25"]}]},{"id":123,"short_name":"hoodwink","display_name":"Hoodwink","description":"Always at hand when trouble's afoot, Hoodwink lives to tangle with the threats that fill the haunted forest she adopted as her home. Toting a \u003cb\u003emassive crossbow\u003c/b\u003e while still able to \u003cb\u003escurry through the woodland\u003c/b\u003e with the greatest of ease, Hoodwink is nearly impossible to keep tabs on in battle. Lose track and she'll pop out behind you -- your stunned carcass already dangling in one of her \u003cb\u003enets.\u003c/b\u003e","lore":"Hoodwink's earliest years were spent in the idyllic expanse of green that once filled the edges of Krimwohl. But as that kingdom grew, and the needs of both her citizens and her armies became ravenous, rival ore and timber barons scratched and clawed to outpace each other in devouring the natural beauty of the border forests, gorging themselves to meet the demands of the changing land.\u003cbr\u003e\u003cbr\u003eTo those living in the ancient timberlands, the choice came down to following the line of refugees into the pacified zones, falling to Krimwohl's black powder and steel while defending their homes, or fleeing further north to tempt fate in the haunted glens and groves of the misty Wood Tomo'kan.\u003cbr\u003e\u003cbr\u003eSo it was in those treacherous northern mistwoods that Hoodwink came of age, dodging the horrific predators of the Tomo'kan, ingratiating herself with some of the local banditry whilst antagonizing others, and finding absolutely every which way to be underfoot whenever some interesting mischief arose--often \u003ci\u003eallegedly\u003c/i\u003e the cause of it.\u003cbr\u003e\u003cbr\u003eBut when the faintest whiff of Krimwohl's fires eventually drifted into her adopted home, Hoodwink's thoughts turned to any family and friends who might have survived the invasion--now made to eke out lives in the razed lands whose wounds scarred her very soul--and she couldn't help but approach the edges of civilization to get a glimpse of the devils that had destroyed her old life.\u003cbr\u003e\u003cbr\u003eThere, she saw that the monsters from her childhood weren't monsters at all. They were just...people. Soldiers, laborers, merchants...and refugees. And the soldiers, even with their black powder and steel, were nothing compared to the dangers of the Tomo'kan--real dangers with tentacles and teeth--dangers she danced around like a twirling maple seed.\u003cbr\u003e\u003cbr\u003eKnowing she can always find safe passage in the tangles of the Tomo'kan, where most warm-blooded folk wisely fear to tread, Hoodwink now strikes out against those who dare try to further pacify the wilds, happily taking what she likes from their belongings, destroying what she has no use for, and helping guide any kindred survivors back to a life in the green once again.","attack_type":"Ranged","primary_attribute":"agi","abilities":[{"id":8429,"short_name":"hoodwink_acorn_shot","display_name":"Acorn Shot","button":"Q","description":"Fires Hoodwink's attack with an acorn at the target unit.  The acorn bounces to nearby targets, slowing them and dealing a percentage of Hoodwink's attack with bonus damage.\nIf point targeted, a tree is created at the target position and the acorn will bounce to nearby targets.  The ability may be placed on alt-cast to force this behavior.","attributes":["BONUS ATTACK RANGE: 75 / 150 / 225 / 300","BOUNCE COUNT: 2 / 3 / 4 / 5","SLOW DURATION: 0.3","MOVEMENT SLOW: 100%","BONUS DAMAGE: 40 / 80 / 120 / 160","BASE DAMAGE: 75%"]},{"id":8158,"short_name":"hoodwink_bushwhack","display_name":"Bushwhack","button":"W","description":"Tosses a net trap that stuns enemies if they are near a tree in the area.  Affected enemies take damage over time and are pulled towards the tree nearest to them within the target area, and have their vision reduced to 0 for the duration of the stun.","attributes":["RADIUS: 265","STUN DURATION: 1.4 / 1.6 / 1.8 / 2.0","TOTAL DAMAGE: 90 / 180 / 270 / 360"]},{"id":9501,"short_name":"hoodwink_scurry","display_name":"Scurry","button":"E","description":"Hoodwink gains bonus movement speed, phased movement, and tree-walking for a brief time.","attributes":["BONUS MOVEMENT SPEED: 20% / 25% / 30% / 35%","BUFF DURATION: 2.0 / 2.5 / 3.0 / 3.5","ACTIVE ATTACK RANGE: 0","ACTIVE CAST RANGE: 0","AOE BONUS: 0"]},{"id":8107,"short_name":"hoodwink_decoy","display_name":"Decoy","button":"F","description":"Hoodwink turns invisible, increasing her movement speed, and creates a decoy illusion that starts aiming a decreased damage Sharpshooter at the nearest enemy hero. If the illusion is attacked or hit by a targeted ability, it is destroyed and it throws a lesser bushwhack towards the enemy.","attributes":["ILLUSION DURATION: 6.0","MOVEMENT SPEED: 15%","BUSHWHACK DURATION: 1.6","BUSHWHACK RADIUS: 250","SHARPSHOOTER DAMAGE: 60%"]},{"id":1422,"short_name":"hoodwink_hunters_boomerang","display_name":"Hunter's Boomerang","button":"D","description":"Tosses a boomerang in an arc. Upon contact, it returns to Hoodwink.  The boomerang will deal damage as it passes through or hits enemies, and apply a debuff that causes affected enemies to be slowed and be more vulnerable to spell damage.","attributes":["DAMAGE: 200","RADIUS: 150","DEBUFF DURATION: 7.0","INCOMING SPELL DAMAGE: 20%","MOVEMENT SLOW: 20%","STATUS RESISTANCE REDUCTION: 0%"]},{"id":1423,"short_name":"hoodwink_mistwoods_wayfarer","display_name":"Mistwoods Wayfarer","button":"R","description":"Hoodwink has a chance to redirect enemy attacks to a nearby tree.","attributes":["REDIRECT CHANCE: 15% / 20% / 25% / 30%","TREE SEARCH RADIUS: 275"]},{"id":8106,"short_name":"hoodwink_sharpshooter","display_name":"Sharpshooter","button":"T","description":"Hoodwink charges up and fires a deadly bolt from her crossbow, dealing heavy damage, break and slow to an enemy Hero. The damage and debuff duration scale up to max after 3.0 seconds, and the bolt is fired automatically after 5.0 seconds.\nHoodwink is knocked backwards for a distance of 350 from the force of the shot. Creeps hit by the bolt are damaged for half the values.","attributes":["MAX WIND-UP TIME: 3.0","MAX DAMAGE: 550 / 900 / 1250","MAX DEBUFF DURATION: 5.0","MOVE SLOW: 30% / 40% / 50%","ARROW SPEED: 2200"]},{"id":8159,"short_name":"hoodwink_sharpshooter_release","display_name":"End Sharpshooter","button":"G","description":"Release the charged up shot, regain ability to move and attack.","attributes":[]}]}]
